dv/auto_dv/evidence/gen_tdd_logs/mutations/gen_fu_l16_trace17_mutant.diff
# The TRACE display mutation as applied to the landing build, the only source difference behind the trace
# session: a w18-derived display build whose per-file list differs from w18 in this one file. Produced by
# diff -u against the landing sources; the session's own compile log and per-file list are retained beside it.
--- landing/dv/auto_dv/tb/gen_tb_pkg.sv	2026-09-04 03:05:15.819263089 -0400
+++ trace17/dv/auto_dv/tb/gen_tb_pkg.sv	2026-09-04 03:17:51.711946432 -0400
@@ -572,6 +572,7 @@
       e.beat = beat; e.bits = bits; e.hit_way = -1; e.verdict = -2; e.verdict_b = -2; e.pulse_cycle = 0; e.rose = rose; e.closed = 1'b0;
       for (int w = 0; w < GEN_IC_NUM_WAYS; w++) begin e.valid_w[w] = shadow_valid(w, index); e.tag_w[w] = shadow_tag(w, index); end
       q.push_back(e);
+      $display("ICTRACE inject kind=%s cycle=%0d way=%0d index=%0d beat=%0d q=%0b v0=%0b v1=%0b t0=%h t1=%h", kind, cycle, way, index, beat, qualified, e.valid_w[0], e.valid_w[1], e.tag_w[0], e.tag_w[1]);
       while (q.size() > 256) void'(q.pop_front());
     endfunction
     static function bit qualified_at(int unsigned cycle);
@@ -597,6 +598,7 @@
     endfunction
     static function void note_lookup(int unsigned cycle, logic [31:0] tag);   // the P9 probe: the tag compared in this cycle
       probe_on = 1; lk_cyc.push_back(cycle); lk_tag.push_back(tag);
+      if (lk_tag.size() == 0 || lk_tag[lk_tag.size()-1] !== tag || 1) $display("ICTRACE lookup cycle=%0d tag=%h", cycle, tag);
       if (lk_cyc.size() > 128) begin void'(lk_cyc.pop_front()); void'(lk_tag.pop_front()); end
     endfunction
     static function void q_set_hit(int unsigned cycle, int unsigned way, int hit_way);   // the judged hit way written back to the announcement
@@ -608,6 +610,7 @@
     endfunction
     static function void note_tag_write(int unsigned cycle, int unsigned ways, int unsigned index, int unsigned way, logic [GEN_IC_TAG_ECC_W-1:0] word);   // called by every tag RAM on its write
       tag_shadow[way][index] = word;
+      $display("ICTRACE tagwrite cycle=%0d way=%0d index=%0d valid=%0b tag=%h", cycle, way, index, shadow_valid(way, index), shadow_tag(way, index));
       if (cycle != last_tag_write_cycle) begin last_tag_write_cycle = cycle; tag_writes_this_cycle = 0; end
       tag_writes_this_cycle++;
       if (tag_writes_this_cycle >= ways) begin   // an all-ways write: the sweep (index 0, or the index after the previous one a cycle later) or an ECC correction of one lookup
